# **01- How to find the version?**

In [1]:
import pandas as pd
pd.__version__

'1.4.4'

In [2]:
# Another way to see the version
pd.show_versions()

c:\Users\MUHAMMAD ADNAN\AppData\Local\Programs\Python\Python310\lib\site-packages\_distutils_hack\__init__.py:33: UserWarning: Setuptools is replacing distutils.
  warnings.warn("Setuptools is replacing distutils.")

INSTALLED VERSIONS
------------------
commit           : ca60aab7340d9989d9428e11a51467658190bb6b
python           : 3.10.7.final.0
python-bits      : 64
OS               : Windows
OS-release       : 10
Version          : 10.0.22623
machine          : AMD64
processor        : Intel64 Family 6 Model 142 Stepping 11, GenuineIntel
byteorder        : little
LC_ALL           : None
LANG             : None
LOCALE           : English_United States.1252

pandas           : 1.4.4
numpy            : 1.23.2
pytz             : 2022.2.1
dateutil         : 2.8.2
setuptools       : 63.2.0
pip              : 22.2.2
Cython           : None
pytest           : None
hypothesis       : None
sphinx           : None
blosc            : None
feather          : None
xlsxwriter       : None
lxml.etree       : 4.9.1
html5lib         : None
pymysql          : None
psycopg2         : None
jinja2           : 3.1.2
IPython          : 8.4.0
pandas_datareader: None
bs4              : 4.11.1
bottleneck       : None
brotli           : None
fastparquet      : None
fsspec           : None
gcsfs            : None
markupsafe       : 2.1.1
matplotlib       : 3.5.3
numba            : None
numexpr          : None
odfpy            : None
openpyxl         : 3.0.10
pandas_gbq       : None
pyarrow          : 9.0.0
pyreadstat       : None
pyxlsb           : None
s3fs             : None
scipy            : 1.9.1
snappy           : None
sqlalchemy       : None
tables           : None
tabulate         : 0.9.0
xarray           : 2022.10.0
xlrd             : None
xlwt             : None
zstandard        : None

# **02- Make a dataframe**

In [3]:
pd.DataFrame({'A column': [1, 2, 3], 'B column': [4, 5, 6], 'C column': [7, 8, 9]})

   A column  B column  C column
0         1         4         7
1         2         5         8
2         3         6         9

In [4]:
# To store the dataframe in a variable, lenght must be same for all columns
df = pd.DataFrame({'A column': [1, 2, 3], 'B column': [4, 5, 6], 'C column': [7, 8, 9]})
df.head()

   A column  B column  C column
0         1         4         7
1         2         5         8
2         3         6         9

In [5]:
# TO save the dataframe to a csv file
df.to_csv('df.csv')

In [6]:
# Numpy array use to create a dataframe
import numpy as np
arr = np.array([[1, 2, 3,4,5,6,7], [4, 5, 6,7,8,9,10], [20,10,5, 4, 5, 6,7]])
arr

array([[ 1,  2,  3,  4,  5,  6,  7],
       [ 4,  5,  6,  7,  8,  9, 10],
       [20, 10,  5,  4,  5,  6,  7]])

In [7]:
# Convert array into dataframe
pd.DataFrame(arr)

    0   1  2  3  4  5   6
0   1   2  3  4  5  6   7
1   4   5  6  7  8  9  10
2  20  10  5  4  5  6   7

In [8]:
# Numpy array use to create a dataframe
pd.DataFrame(np.random.rand(4, 8))

,0,1,2,3,4,5,6,7
0,0.267460,0.340641,0.084757,0.203121,0.759536,0.030768,0.784516,0.231253
1,0.611559,0.765451,0.286348,0.500472,0.141387,0.662736,0.686636,0.476863
2,0.743956,0.974903,0.869117,0.720256,0.545569,0.615348,0.260619,0.556099
3,0.442678,0.109400,0.533130,0.201237,0.547484,0.677412,0.029379,0.396683

In [9]:
# To give the name of columns in the above generated dataframe
pd.DataFrame(np.random.rand(4, 8), columns=['A', 'B', 'C', 'D', 'E', 'F', 'G', 'H'])

,A,B,C,D,E,F,G,H
0,0.505873,0.482874,0.465843,0.267485,0.242796,0.755576,0.692204,0.799213
1,0.472334,0.203202,0.315895,0.682884,0.399506,0.611401,0.612921,0.627469
2,0.625816,0.974004,0.641407,0.488804,0.115820,0.119095,0.375483,0.740488
3,0.131089,0.497200,0.377779,0.798514,0.397011,0.064730,0.722488,0.594670

# **03 How to rename columns**

In [10]:
# Create dataframe from dictionary
df = pd.DataFrame({'Col':[1,2,3,4,5,6,7,8,9,10], 'Col2':[11,12,13,14,15,16,17,18,19,20]})
df.head()

   Col  Col2
0    1    11
1    2    12
2    3    13
3    4    14
4    5    15

In [11]:
# Rename columns (Method 1)
df.rename(columns={'Col':'Column1', 'Col2':'Column2'}, inplace=True)
df.head()

   Column1  Column2
0        1       11
1        2       12
2        3       13
3        4       14
4        5       15

In [12]:
# Rename columns (Method 2)
df.columns=['Column_A', 'Column_B']
df.head()

   Column_A  Column_B
0         1        11
1         2        12
2         3        13
3         4        14
4         5        15

In [13]:
# To replace any character, string, _ is removed from the column name
df.columns=df.columns.str.replace('_', ' ')
df.head()

   Column A  Column B
0         1        11
1         2        12
2         3        13
3         4        14
4         5        15

In [14]:
# To add _ in the datafreame column name
df.columns=df.columns.str.replace(' ', '_')
df.head()

   Column_A  Column_B
0         1        11
1         2        12
2         3        13
3         4        14
4         5        15

In [15]:
# Adding prefix to columns
df = df.add_prefix('Aadi_')
df.head()

   Aadi_Column_A  Aadi_Column_B
0              1             11
1              2             12
2              3             13
3              4             14
4              5             15

In [16]:
# Adding suffix to columns
df = df.add_suffix('_Aadi')
df.head()

   Aadi_Column_A_Aadi  Aadi_Column_B_Aadi
0                   1                  11
1                   2                  12
2                   3                  13
3                   4                  14
4                   5                  15

In [17]:
df.columns = ['col_A', 'col_B']
df

   col_A  col_B
0      1     11
1      2     12
2      3     13
3      4     14
4      5     15
5      6     16
6      7     17
7      8     18
8      9     19
9     10     20

# **04 Using template data**

In [18]:
import pandas as pd
import numpy as np
import seaborn as sns

kashti = sns.load_dataset('titanic')
kashti.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [19]:
# Renmae the columns
kashti.rename(columns={'age': 'Age', 'sex': 'Sex'}, inplace=True)
kashti.head()

,survived,pclass,Sex,Age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [20]:
# Data info
kashti.describe()

         survived      pclass         Age       sibsp       parch        fare
count  891.000000  891.000000  714.000000  891.000000  891.000000  891.000000
mean     0.383838    2.308642   29.699118    0.523008    0.381594   32.204208
std      0.486592    0.836071   14.526497    1.102743    0.806057   49.693429
min      0.000000    1.000000    0.420000    0.000000    0.000000    0.000000
25%      0.000000    2.000000   20.125000    0.000000    0.000000    7.910400
50%      0.000000    3.000000   28.000000    0.000000    0.000000   14.454200
75%      1.000000    3.000000   38.000000    1.000000    0.000000   31.000000
max      1.000000    3.000000   80.000000    8.000000    6.000000  512.329200

In [21]:
kashti.columns

Index(['survived', 'pclass', 'Sex', 'Age', 'sibsp', 'parch', 'fare',
       'embarked', 'class', 'who', 'adult_male', 'deck', 'embark_town',
       'alive', 'alone'],
      dtype='object')

In [23]:
kashti.to_csv('kashti.csv')
kashti.to_excel('kashti.xlsx')